# -*- coding: utf8 -*-
import telebot
from congst import *
bot = telebot.TeleBot(api_token)

def choice3(vibor, way):
# ====================📱 SAMSUNG 📊Характеристики======================================================
#=====================================================================================================
    if (way[len(way)-1] == '📱 SAMSUNG') and (vibor == '📊Характеристики'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Марка', '⭕️Модель')
        keyboard.row('⭕️Год выпуска', '⭕️Емкость памяти')
        keyboard.row('↩️Назад')
        text = 'Характеристики'
        return keyboard, text
# ====================📱 SAMSUNG 📳Внешний осмотр======================================================
#=====================================================================================================
    elif (vibor == '📳Внешний осмотр') and (way[len(way)-1] == '📱 SAMSUNG'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Дисплей - Передняя часть')
        keyboard.row('⭕️Корпус - Задняя часть')
        keyboard.row('⭕️Корпус - Боковой части')
        keyboard.row('⭕️Стекло КАМЕРЫ (передняя и задняя)')
        keyboard.row('↩️Назад')
        text = 'Внешний осмотр'
        return keyboard, text
# ==================================================================================================
# ----------------------'📱 SAMSUNG'---------------------------------------------------------
# ==================================================================================================
# ====================📱 SAMSUNG 📴Работоспособность======================================================
#=====================================================================================================
    elif (way[len(way)-1] == '📱 SAMSUNG') and (vibor == '📴Работоспособность'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Зарядный порт', '⭕️Яркость')
        keyboard.row('⭕️Проверка Wi-Fi')
        keyboard.row('⭕️Камера передняя \ задняя')
        keyboard.row('⭕️Вибрация', '⭕️Динамики')
        keyboard.row('⭕️Сим Слот, связь', '↩️Назад')
        text = 'Работоспособность'
        return keyboard, text
# ====================📱 SAMSUNG 🈴Определения реплик======================================================
#=====================================================================================================
    elif (way[len(way)-1] == '📱 SAMSUNG') and (vibor == '🈴Определения реплик'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣ Наличие и работа Samsung Cloud')
        keyboard.row('2️⃣ Внешние отличия (Китай.иероглифы)')
        keyboard.row('3️⃣ Функционал фронтальной камеры')
        keyboard.row('4️⃣ Отличия при перезагрузке смартфона')
        keyboard.row('5️⃣ Версия KNOX, как дополнительный критерий')
        keyboard.row('6️⃣ Отклонения в работе функционала *#0*# (Samsung)')
        keyboard.row('7️⃣ BIOS')
        keyboard.row('↩️Назад')
        text = 'Определения реплик'
        return keyboard, text
# ====================📱 SAMSUNG ✳️Полезные комбинации======================================================
#=====================================================================================================
    elif (way[len(way)-1] == '📱 SAMSUNG') and (vibor == '✳️Полезные комбинации'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('↩️Назад')
        text = 'Полезные комбинации'
        return keyboard, text
# ==================================================================================================
# ----------------------'📱 IPHONE'---------------------------------------------------------
# ==================================================================================================
# ====================📱 IPHONE 📊Характеристики======================================================
# =====================================================================================================
    elif (vibor == '📊Характеристики') and (way[len(way)-1] == '📱 IPHONE'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Марка', '⭕️Модель')
        keyboard.row('⭕️Емкость памяти', '↩️Назад')
        text = 'Характеристики'
        return keyboard, text
# ====================📱 IPHONE 📳Внешний осмот======================================================
# =====================================================================================================
    elif (vibor == '📳Внешний осмотр') and (way[len(way)-1] == '📱 IPHONE'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Дисплей - Передняя часть')
        keyboard.row('⭕️Корпус - Задняя часть')
        keyboard.row('⭕️Корпус - Боковой части')
        keyboard.row('⭕️Вздутие батареи')
        keyboard.row('⭕️Стекло КАМЕРЫ (передняя и задняя)')
        keyboard.row('↩️Назад')
        text = 'Внешний осмотр'
        return keyboard, text
# ====================📱 IPHONE 📴Работоспособность======================================================
# =====================================================================================================
    elif (vibor == '📴Работоспособность') and (way[len(way)-1] == '📱 IPHONE'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Проверка Wi-Fi/ Bluetooth')
        keyboard.row('⭕️Сим Слот, связь', '⭕️Яркость')
        keyboard.row('⭕️Audio kodak', '⭕️Зарядный порт')
        keyboard.row('⭕️Face id \ Touch', '⭕️Динамики')
        keyboard.row('⭕️Камера передняя \ задняя')
        keyboard.row('⭕️Вибрация', '⭕️Фонарик')
        keyboard.row('⭕️iCloud', '↩️Назад')
        text = 'Работоспособность'
        return keyboard, text
# ====================📱 IPHONE 🈴Определения реплик======================================================
# =====================================================================================================
    elif (vibor == '🈴Определения реплик') and (way[len(way)-1] == '📱 IPHONE'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('↩️Назад')
        text = 'Определения реплик'
        return keyboard, text
# ==================================================================================================
# ----------------------'📱 другие модели'---------------------------------------------------------
# ==================================================================================================
# ====================📱 другие модел obschee======================================================
# =====================================================================================================
    elif (vibor == '📱 другие модели') and (way[len(way)-1] == '📱 другие модели'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
# Следуещее действие Видео
# Следуещее действие PDF
# Следуещее действие кнопки назад и главная


# ==================================================================================================
# ----------------------'💍 ЗОЛОТО'---------------------------------------------------------
# ==================================================================================================
# ====================💍 ЗОЛОТО 📒О золоте======================================================
# =====================================================================================================
    elif (vibor == '📒О золоте') and (way[len(way)-1] == '💍 ЗОЛОТО'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Виды проб', '2️⃣Клеймо')
        keyboard.row('3️⃣Цвет золота')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'О золоте'
        return keyboard, text
# ====================💍 ЗОЛОТО ⚠️ПРОВЕРКА-ЗОЛОТА======================================================
# =====================================================================================================
    elif (vibor == '⚠️ПРОВЕРКА-ЗОЛОТА') and (way[len(way)-1] == '💍 ЗОЛОТО'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Проверка на магнит')
        keyboard.row('2️⃣Визуальный осмотр(Именник и Проба)')
        keyboard.row('3️⃣Проверка на качество и подленность')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'ПРОВЕРКА-ЗОЛОТА'
        return keyboard, text
# ====================💍 ЗОЛОТО 💰ОЦЕНКА СТОИМОСТИ======================================================
# =====================================================================================================
    elif (vibor == '💰ОЦЕНКА СТОИМОСТИ') and (way[len(way)-1] == '💍 ЗОЛОТО'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Вставки', '2️⃣Оценка')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'ОЦЕНКА СТОИМОСТИ'
        return keyboard, text
# ====================💍 ЗОЛОТО 📣Полезная информация======================================================
# =====================================================================================================
    elif (vibor == '📣Полезная информация') and (way[len(way)-1] == '💍 ЗОЛОТО'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Пользование тестором')
        keyboard.row('⭕️Пользование штангель циркулем')
        keyboard.row('⭕️Уход за камнем проверки золота')
        keyboard.row('⭕️Заводской стандарт')
        keyboard.row('⭕️Размеры изделий', '⭕️Чистка золото')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Полезная информация'
        return keyboard, text
# ==================================================================================================
# ----------------------'💻 НОУТБУКИ'---------------------------------------------------------
# ==================================================================================================
# ====================💻 НОУТБУКИ 1️⃣Виды ноутбуков======================================================
# =====================================================================================================
    elif (vibor == '1️⃣Виды ноутбуков') and (way[len(way)-1] == '💻 НОУТБУКИ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Ноутбуки', '⭕️Ультрабуки')
        keyboard.row('⭕️Нэтбуки', '⭕️Игровые ноутбуки')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Виды ноутбуков'
        return keyboard, text
# ====================💻 НОУТБУКИ 2️⃣Визуальный осмотр======================================================
# =====================================================================================================
    elif (vibor == '2️⃣Визуальный осмотр') and (way[len(way)-1] == '💻 НОУТБУКИ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Внешний осмотр крепления')
        keyboard.row('2️⃣Внешний осмотр корпуса')
        keyboard.row('3️⃣Внешний осмотр дисплея')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Визуальный осмотр'
        return keyboard, text
# ====================💻 НОУТБУКИ 3️⃣Технические характеристики======================================================
# =====================================================================================================
    elif (vibor == '3️⃣Технические характеристики') and (way[len(way)-1] == '💻 НОУТБУКИ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Жесткий диск', '2️⃣Процессор')
        keyboard.row('3️⃣ОЗУ', '4️⃣Видео карта')
        keyboard.row('5️⃣Ядры', '6️⃣Wi-fi')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Технические характеристики'
        return keyboard, text
# ====================💻 НОУТБУКИ 4️⃣Вспомогательные программыв======================================================
# =====================================================================================================
    elif (vibor == '4️⃣Вспомогательные программы') and (way[len(way)-1] == '💻 НОУТБУКИ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('⭕️Aida24', '⭕️Cristall Disk')
        keyboard.row('⭕️CpuZ', '⭕️Клавиатура')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Вспомогательные программы'
        return keyboard, text
# ====================💻 НОУТБУКИ 5️⃣Проверка на прошитость======================================================
# =====================================================================================================
    elif (vibor == '5️⃣Проверка на прошитость') and (way[len(way)-1] == '💻 НОУТБУКИ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Проверка на прошитость'
        return keyboard, text
        pass  # Следуещее действие Видео

# ==================================================================================================
# ----------------------'🎧 НАУШНИКИ AIRPODS'---------------------------------------------------------
# ==================================================================================================
# ====================🎧 НАУШНИКИ AIRPODS 1️⃣Виды AirPods======================================================
# =====================================================================================================
    elif (vibor == '1️⃣Виды AirPods') and (way[len(way)-1] == '🎧 НАУШНИКИ AIRPODS'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Виды AirPods'
        return keyboard, text
        pass  # Следуещее действие Видео PDF
# ====================🎧 НАУШНИКИ AIRPODS 2️⃣Подключение и проверка AirPods======================================================
# =====================================================================================================
    elif (vibor == '2️⃣Подключение и проверка AirPods') and (way[len(way)-1] == '🎧 НАУШНИКИ AIRPODS'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Подключение и проверка AirPods'
        return keyboard, text
        pass  # Следуещее действие Видео, PDF
# ====================🎧 НАУШНИКИ AIRPODS 3️⃣Выявления реплик======================================================
# =====================================================================================================
    elif (vibor == '3️⃣Выявления реплик') and (way[len(way)-1] == '🎧 НАУШНИКИ AIRPODS'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Выявления реплик'
        return keyboard, text
        pass  # Следуещее действие Видео PDF

# ==================================================================================================
# ----------------------'⌚ ЧАСЫ APPLE WHATCH'---------------------------------------------------------
# ==================================================================================================
# ====================⌚ ЧАСЫ APPLE WHATCH 1️⃣Виды======================================================
# =====================================================================================================
    elif (vibor == '1️⃣Виды') and (way[len(way)-1] == '⌚ ЧАСЫ APPLE WHATCH'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Виды'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================⌚ ЧАСЫ APPLE WHATCH 2️⃣Оценка состояния======================================================
# =====================================================================================================
    elif (vibor == '2️⃣Оценка состояния') and (way[len(way)-1] == '⌚ ЧАСЫ APPLE WHATCH'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Оценка состояния'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================⌚ ЧАСЫ APPLE WHATCH 3️⃣Разрыв пары======================================================
# =====================================================================================================
    elif (vibor == '3️⃣Разрыв пары') and (way[len(way)-1] == '⌚ ЧАСЫ APPLE WHATCH'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Разрыв пары'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================⌚ ЧАСЫ APPLE WHATCH 4️⃣Зарядные станции======================================================
# =====================================================================================================
    elif (vibor == '4️⃣Зарядные станции') and (way[len(way)-1] == '⌚ ЧАСЫ APPLE WHATCH'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Зарядные станции'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================⌚ ЧАСЫ APPLE WHATCH 5️⃣Ремешки часов======================================================
# =====================================================================================================
    elif (vibor == '5️⃣Ремешки часов') and (way[len(way)-1] == '⌚ ЧАСЫ APPLE WHATCH'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Ремешки часов'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================⌚ ЧАСЫ APPLE WHATCH 6️⃣Серия и размер======================================================
# =====================================================================================================
    elif (vibor == '6️⃣Серия и размер') and (way[len(way)-1] == '⌚ ЧАСЫ APPLE WHATCH'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Серия и размер'
        return keyboard, text
        pass  # Следуещее действие Видео

# ==================================================================================================
# ----------------------'📷 ФОТО АППАРАТЫ'---------------------------------------------------------
# ==================================================================================================
# ====================📷 ФОТО АППАРАТЫ 1️⃣Виды======================================================
# =====================================================================================================
    elif (vibor == '1️⃣Виды') and (way[len(way)-1] == '📷 ФОТО АППАРАТЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Виды'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================📷 ФОТО АППАРАТЫ 2️⃣Название частей======================================================
# =====================================================================================================
    elif (vibor == '2️⃣Название частей') and (way[len(way)-1] == '📷 ФОТО АППАРАТЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Название частей'
        return keyboard, text
        pass  # Следуещее действие Видео, PDF
# ====================📷 ФОТО АППАРАТЫ 3️⃣Визуальный осмотр=====================================================
# =====================================================================================================
    elif (vibor == '3️⃣Визуальный осмотр') and (way[len(way)-1] == '📷 ФОТО АППАРАТЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Внешний осмотр', '2️⃣Внутренний осмотр')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Визуальный осмотр'
        return keyboard, text
# ====================📷 ФОТО АППАРАТЫ 4️⃣Работоспособность======================================================
# =====================================================================================================
    elif (vibor == '4️⃣Работоспособность') and (way[len(way)-1] == '📷 ФОТО АППАРАТЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Проверка фокусировки', '2️⃣Осмотр сьемки')
        keyboard.row('3️⃣Зарядное устройство', '4️⃣НЕ допустимые дефекты')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Работоспособность'
        return keyboard, text
# ====================📷 ФОТО АППАРАТЫ 5️⃣Примечание======================================================
# =====================================================================================================
    elif (vibor == '5️⃣Примечание') and (way[len(way)-1] == '📷 ФОТО АППАРАТЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Примечание'
        return keyboard, text
        pass  # Следуещее действие Видео

# ==================================================================================================
# ----------------------'🧥 ШУБЫ'---------------------------------------------------------
# ==================================================================================================
# ====================🧥 ШУБЫ 1️⃣Виды======================================================
# =====================================================================================================
    elif (vibor == '1️⃣Виды') and (way[len(way)-1] == '🧥 ШУБЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню(', '↩️Назад')
        text = 'Виды'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================🧥 ШУБЫ 2️⃣Визуальный осмотр======================================================
# =====================================================================================================
    elif (vibor == '2️⃣Визуальный осмотр') and (way[len(way)-1] == '🧥 ШУБЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('1️⃣Внешний осмотр')
        keyboard.row('2️⃣Внутренний осмотр')
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Визуальный осмотр'
        return keyboard, text
# ====================🧥 ШУБЫ 3️⃣Отличие Норки======================================================
# =====================================================================================================
    elif (vibor == '3️⃣Отличие Норки') and (way[len(way)-1] == '🧥 ШУБЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Отличие Норки'
        return keyboard, text
        pass  # Следуещее действие Видео
# ====================🧥 ШУБЫ 4️⃣Плюсы и минусы моделей======================================================
# =====================================================================================================
    elif (vibor == '4️⃣Плюсы и минусы моделей') and (way[len(way)-1] == '🧥 ШУБЫ'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('🔁Главное меню', '↩️Назад')
        text = 'Плюсы и минусы моделей'
        return keyboard, text
        pass  # Следуещее действие Видео

# ==================================================================================================
# ----------------------'ШАГ 1️⃣ ПОДГОТОВКА'---------------------------------------------------------
# ==================================================================================================
# ====================ШАГ 1️⃣ ПОДГОТОВКА 2️⃣Шаги продаж======================================================
# =====================================================================================================


    elif (vibor == 'ШАГ 1️⃣ ПОДГОТОВКА') and (way[len(way)-1] == '2️⃣Шаги продаж'):
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('↩️Назад', '🛠ТЕХНИЧЕСКАЯ')
        text = 'ПОДГОТОВКИ, Она бывает 2х видов:\n 🛠Техническая и 💆🏻‍♀️💆🏻‍♂️Эмоциональная'
        podgotovka = "Вы наверняка сами не раз были свидетелями как недовольный с утра продавец😑, " \
                     "через силу пытаясь улыбнуться и делая вам одолжение🙂, начинает продавать.\n\n" \
                     "Не приятно, правда❓🤢\n\nНа лице у такого сотрудника видно🥴, что он не готов не только к консультации," \
                     "но и к работе вообще.\n\nПосле такого настроя на грядущий день, успешные✅" \
                     "сделки и удовлетворенные клиенты😇–просто миф✨❗ Понимаете о чем я❓\n\n" \
                     "Ощущаете важность первого этапа❓\n\n" \
                     "Искусство произвести приятное впечатление с первой минуты разговора, " \
                     "умножит шансы превратить собеседника в клиента‼️"
        return keyboard, text, podgotovka

    # elif (vibor == 'Постановка целей по Смарт') and (way[len(way)-1] == '3️⃣Доп курсы'):
    #     keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
    #     keyboard.row('Постановка целей по Смарт', 'Работа с голосом')
    #     keyboard.row('Small talk', '↩️Назад')
    #     text = 'ПОДГОТОВКИ'
    #     return keyboard, text

