# -*- coding: utf8 -*-

import telebot
from congst import *


bot = telebot.TeleBot(api_token)
# Техническая ----ВИДЕО----
def choice4(vibor):
    if vibor == '🛠ТЕХНИЧЕСКАЯ':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Задание⁉️')
        keyboard.row('↩️Назад', '↪️Далее')
        text = '🛠ТЕХНИЧЕСКОЙ ПОДГОТОВКИ'
        return keyboard, text
# ПОСЛЕ---Техническая ----ДАЛЕЕ----
def choice5(vibor):
    if vibor == '↪️Далее':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('↩️Назад', '💆🏻‍♀️💆🏻‍♂️ЭМОЦИОНАЛЬНЯ')
        text = '🛠Техническую подготовку, Перейдите в 💆🏻‍♀️💆🏻‍♂️Эмоциональную подготовку'
        return keyboard, text
# Эмоциоальная ----ВИДЕО----
def choice6(vibor):
    if vibor == '💆🏻‍♀️💆🏻‍♂️ЭМОЦИОНАЛЬНЯ':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Задание⁉️')
        keyboard.row('↩️Назад', '↪️Далее')
        text = '💆🏻‍♀️💆🏻‍♂️ЭМОЦИОНАЛЬНОЙ ПОДГОТОВКИ'
        return keyboard, text
# ПОСЛЕ---Эмоциональная ----ДАЛЕЕ----
def choice7(vibor):
    if vibor == '↪️Далее':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('ШАГ 2️⃣ ПРИВЕТСТВИЕ. УСТАНОВЛЕНИЕ КОНТАКТА')
        keyboard.row('↩️Назад')
        text = 'ПРИВЕТСТВИЕ. УСТАНОВЛЕНИЕ КОНТАКТА'
        uk = "⭕️Умение общаться с людьми - это товар, и я заплачу за него больше, " \
             "чем за что-нибудь другое на свете☝🏼\n" \
             "Джон Дэвисон Рокфеллер©\n\n" \
            "Для клиентов при выборе ломбарда 🧐 фактор личной симпатии или антипатии тоже может стать решающим✅❎❎. " \
             "Искусство произвести приятное впечатление с первой минуты⏳ разговора умножит шансы превратить собеседника " \
             "в постоянного клиента.😍"

        return keyboard, text, uk
# 2️⃣ ПРИВЕТСТВИЕ. УСТАНОВЛЕНИЕ КОНТАКТА ----ВИДЕО----
def choice8(vibor):
    if vibor == 'ШАГ 2️⃣ ПРИВЕТСТВИЕ. УСТАНОВЛЕНИЕ КОНТАКТА':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Задание⁉️')
        keyboard.row('↩️Назад', '↪️Далее')
        text = 'Приветствия и Установления контакта!'
        return keyboard, text
# ПОСЛЕ---2️⃣ ПРИВЕТСТВИЕ. УСТАНОВЛЕНИЕ КОНТАКТА ----Далее----
def choice9(vibor):
    if vibor == '↪️Далее':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('ШАГ 3️⃣ ВЫЯВЛЕНИЕ ПОТРЕБНОСТЕЙ')
        keyboard.row('↩️Назад')
        text = 'Потребность — ощущение нехватки или недостаточности чего-либо.⚖' \
               'В продажах это нужда, которая закрывается приобретением какого-то товара или услуги. ✅📝\n\n' \
               '❌Распространенная ошибка — рассказывать о преимуществах товара или услуги, которые вы сами считаете важными🔝. ' \
               'В мире потребителя они могут иметь гораздо меньшую ценность💱😒. ' \
               'На первом месте будут те качества, которые закрывают их потребность📊. \n\n' \
               'Например, при оценке залога у потенциального клиент есть сомнения по поводу надежности компании🏪, ' \
               'а вы рассказываете только об условиях.📝  Если не переключиться на рассказ о надежности компании🏪, ' \
               'есть риск, что клиент уйдет без сделки.\n\n' \
               'Чтобы продать займ или товар,🔀 специалисту нужно понять, какая потребность📊 привела покупателя в филиал. ' \
               'Узнайте, что на самом деле скрывается за желанием обладать вашим продуктом❓ и поймете, как его продавать❗️'
        return keyboard, text
# 3️⃣ ВЫЯВЛЕНИЕ ПОТРЕБНОСТЕЙ ----ВИДЕО----
def choice10(vibor):
    if vibor == 'ШАГ 3️⃣ ВЫЯВЛЕНИЕ ПОТРЕБНОСТЕЙ':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Задание⁉️')
        keyboard.row('↩️Назад', '↪️Далее')
        text = 'ВЫЯВЛЕНИЙ ПОТРЕБНОСТЕЙ'
        return keyboard, text
# ПОСЛЕ---3️⃣ ВЫЯВЛЕНИЕ ПОТРЕБНОСТЕЙ ----Далее----
def choice11(vibor):
    if vibor == '↪️Далее':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('ШАГ 4️⃣ ПРЕЗЕНТАЦИЯ')
        keyboard.row('↩️Назад')
        text = 'ПРЕЗЕНТАЦИЯ -🏅 Один из самых важных этапов лестницы🔤 продаж, ' \
               'который дает возможность представить потенциальному клиенту преимущества услуги или товара и ' \
               'мотивировать клиента к заключению сделки🎇🎆🌠🌅.\n\n' \
               ' Из чего должна состоят ваша презентация❓\n' \
               '1️⃣ КРАСНАЯ КНОПКА\n' \
               '2️⃣ Язык ВЫгоды\n' \
               '3️⃣ СВД\n' \
               '4️⃣ Визуализация'
        return keyboard, text
# 4️⃣ ПРЕЗЕНТАЦИЯ ----ВИДЕО----
def choice12(vibor):
    if vibor == 'ШАГ 4️⃣ ПРЕЗЕНТАЦИЯ':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Задание⁉️')
        keyboard.row('↩️Назад', '↪️Далее')
        text = 'ПРЕЗЕНТАЦИИ'
        return keyboard, text
# ПОСЛЕ---4️⃣ ПРЕЗЕНТАЦИЯ ----Далее----
def choice13(vibor):
    if vibor == '↪️Далее':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('ШАГ 5️⃣ ОТРАБОТКА ВОЗВРАЖЕНИЙ')
        keyboard.row('↩️Назад')
        text = 'ПОКА НЕТУ'
        return keyboard, text
# 5️⃣ ОТРАБОТКА ВОЗВРАЖЕНИЙ ----ВИДЕО----
def choice14(vibor):
    if vibor == 'ШАГ 5️⃣ ОТРАБОТКА ВОЗВРАЖЕНИЙ':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Задание⁉️')
        keyboard.row('↩️Назад', '↪️Далее')
        text = 'ОТРАБОТКИ ВОЗВРАЖЕНИЙ'
        return keyboard, text
# ПОСЛЕ---5️⃣ ОТРАБОТКА ВОЗВРАЖЕНИЙ ----Далее----
def choice15(vibor):
    if vibor == '↪️Далее':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('ШАГ 6️⃣ ЗАВЕРШЕНИЕ СДЕЛКИ')
        keyboard.row('↩️Назад')
        text = 'ПОКА НЕТУ'
        return keyboard, text
# 6️⃣ ЗАВЕРШЕНИЕ СДЕЛКИ ----ВИДЕО----
def choice16(vibor):
    if vibor == 'ШАГ 6️⃣ ЗАВЕРШЕНИЕ СДЕЛКИ':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Задание⁉️')
        keyboard.row('↩️Назад', '↪️Далее')
        text = 'ЗАВЕРШЕНИЕ СДЕЛКИ'
        return keyboard, text
# ПОСЛЕ---6️⃣ ЗАВЕРШЕНИЕ СДЕЛКИ ----Далее----
def choice17(vibor):
    if vibor == '↪️Далее':
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('↩️Назад', 'ШАГ 7️⃣ АНАЛИЗ')
        text = 'ПОКА НЕТУ'
        return keyboard, text
# 7️⃣ АНАЛИЗ ----PDF---Test----
def choice18(vibor):
    if vibor == 'ШАГ 7️⃣ АНАЛИЗ':
        #PDF
        keyboard = telebot.types.ReplyKeyboardMarkup(True, True)
        keyboard.row('Скачать PDF', 'Пройти Тест')
        keyboard.row('↩️Назад', '🔁Главное меню')

        return keyboard



