# -*- coding: utf8 -*-
menu = '1'
way_list = []
import telebot
from congst import *
import mysql.connector
bot = telebot.TeleBot(api_token)
from menu1 import *
from menu2 import *
from menu3 import *
from menu4 import *
from main_back_buttons import *
study_list = []
#===============================================================================================================
# база данных для доступа
#===============================================================================================================

mydb = mysql.connector.connect(host="localhost", user="root", passwd="", database="lombard_telegram")
cursor = mydb.cursor(buffered=True)
mycursor = mydb.cursor()
cursor.execute("SELECT * FROM dostup_obuchenie")
rown = cursor.fetchall()
mydb.commit()
print(rown)
users_name = []
for i in rown:
    users_name.append(i[1])
print(users_name)
#===============================================================================================================
#===============================================================================================================
@bot.message_handler(content_types=['text'])
def start_message(message):
    global menu, way_list
    if str(message.from_user.username) in users_name:
        if menu == "0" : menu = '1'
# 1-меню ==============================================================================
#-БЛОК СТАРТ МЕНЮ===========================================================================
#======================================================================================
        if  menu == '1' or message.text.lower() == "/start" or message.text.lower() == '🔁Главное меню':
            keyboard = start_menu()
            bot.send_message(message.from_user.id, "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                            reply_markup=keyboard)
            way_list.append('🔁Главное меню')
            menu = '2'
        else:
# ===========================================================================================================
# -БЛОК ВХОД В 1 КНОПКИ======================================================================================
# ===========================================================================================================
            if menu == '2':
    # ===Главная===========================================================================
                if message.text.lower() == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
                else:
                    key1, text = choice1(message.text)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text, reply_markup=key1)
                    menu = '3'
                    way_list.append(message.text)
# ===========================================================================================================
# -БЛОК ВХОД ВО 2 КНОПКИ видео=====================================================================================
# ===========================================================================================================
            elif menu == '3':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===видео===========================================================================
                elif message.text == '1️⃣Вводный курс':
                    key2, text, text2 = choice2(message.text, way_list)
                    video = open("videos/vvedenie.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
    # ===FAQ.PDF===========================================================================
                    document = open("file/FAQ.pdf", 'rb')
                    bot.send_chat_action(message.from_user.id, 'upload_document')
                    bot.send_document(message.from_user.id, document)
                    document.close()

                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\n" + text2,
                                     reply_markup=key2)
                    menu = '4'
                    way_list.append(message.text)
                    study_list.append("Введение")
                    study_list.append("text")

                elif message.text == '2️⃣Шаги продаж':
                    key2, text = choice2(message.text, way_list)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\n" + text,
                                     reply_markup=key2)
                    menu = '4'
                    way_list.append(message.text)
                    study_list.append("Введение")
                    study_list.append("text")
                else:
                    key2, text = choice2(message.text, way_list)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\n" + text,
                                     reply_markup=key2)
                    menu = '4'
                    way_list.append(message.text)
                    study_list.append("Введение")
                    study_list.append("text")
# ===========================================================================================================
# -БЛОК ВХОД В 3 КНОПКИ======================================================================================
# ===========================================================================================================
            elif menu == '4':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                elif message.text == 'ШАГ 1️⃣ ПОДГОТОВКА':
                    key3, text, text2 = choice3(message.text, way_list)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\n\n" + text2+ "!\n\nВы в меню " + text, reply_markup=key3)
                    menu = '5'
                    way_list.append(message.text)
                    study_list.append("Техническая")
                    study_list.append("text")
                else:
                    key3, text = choice3(message.text, way_list)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text,
                                     reply_markup=key3)
                    menu = '5'
                    way_list.append(message.text)
                    study_list.append("Общая")
                    study_list.append("text")
# ===========================================================================================================
# -БЛОК ВХОД В 4 КНОПКИ======================================================================================
# ===========================================================================================================
            elif menu == '5':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                elif message.text == '🛠ТЕХНИЧЕСКАЯ':
                    key4, text = choice4(message.text)
                    video = open("videos/Tehnicheskaya.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text, reply_markup=key4)
                    menu = '6'
                    way_list.append(message.text)
                    study_list.append("Техническая")
                    study_list.append("text")
                else:
                    key4, text = choice4(message.text)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text,
                                     reply_markup=key4)
                    menu = '6'
                    way_list.append(message.text)
                    study_list.append("Общая")
                    study_list.append("text")

# ===========================================================================================================
# -БЛОК ВХОД В 5 КНОПКИ-ДАЛЕЕ================================================================================
# ===========================================================================================================
            elif menu == '6':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Далее кнопка===========================================================================

                elif message.text == 'Задание⁉️ (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':

                    img = open("file/unnamed.png", 'rb')
                    bot.send_chat_action(message.from_user.id, 'upload_photo')
                    bot.send_photo(message.from_user.id, img)
                    img.close()

                    # tehnicheskayazadanie1 = []
                    # tehnicheskayazadanie2 = []
                    # tehnicheskayazadaniemenu = '1'
                    # # @bot.message_handler(content_types=['text'])
                    #
                    # # global tehnicheskayazadaniemenu
                    #
                    # if message.text == 'Задание⁉️':
                    #     print('=========')
                    #     bot.send_message(message.from_user.id, "1.1 Почему важна подготовка?")
                    #     tehnicheskayazadanie1.append(message.from_user)
                    #     print(message)
                    #     tehnicheskayazadaniemenu = '2'
                    #     print(tehnicheskayazadanie1)
                    #     # elif tehnicheskayazadaniemenu == '2':
                    #     #     print('===========')
                    #     #     bot.send_message(message.chat.id, "1.2 Как поддготовится технически? Сделайте себе чек лист!")
                    #     #     tehnicheskayazadanie2.append(message.text)

                elif message.text == '↪️Далее':
                    key5, text = choice5(message.text)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы прошли " + text, reply_markup=key5)
                    menu = '7'
                    way_list.append(message.text)
                    study_list.append("Далее")
                    study_list.append("text")
# ===========================================================================================================
# -БЛОК ВХОД В 6 КНОПКИ======================================================================================
# ===========================================================================================================
            elif menu == '7':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                else:
                    key6, text = choice6(message.text)
                    video = open("videos/Emocionalnaya.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text, reply_markup=key6)
                    menu = '8'
                    way_list.append(message.text)
                    study_list.append("Эмоциональная")
                    study_list.append("text")
# ===========================================================================================================
#-БЛОК ВХОД В 7 КНОПКИ-ДАЛЕЕ=================================================================================
# ===========================================================================================================
            elif menu == '8':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Далее кнопка===========================================================================
                else:
                    if message.text == 'Задание⁉️ (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                        pass # задание
                        # (картинка)
                        # 1,3 Поделитесь своим способом поднятия настроения. Запишите краткое видео о том, как вы настраиваетесь на работу.
                    elif message.text == '↪️Далее':
                        key7, text, text2 = choice7(message.text)
                        name = message.from_user.first_name
                        bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\n" + text2,
                                         reply_markup=key7)
                        menu = '9'
                        way_list.append(message.text)
                        study_list.append("Приветствие и установление контакта")
                        study_list.append("text")
# ===========================================================================================================
# -БЛОК ВХОД В 8 КНОПКИ-ВИДЕО================================================================================
# ===========================================================================================================
            elif menu == '9':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                else:
                    key8, text = choice8(message.text)
                    video = open("videos/privetstvie_i_ustanovlenie_kontakta.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text, reply_markup=key8)
                    menu = '10'
                    way_list.append(message.text)
                    study_list.append("Приветствие и установление контакта")
                    study_list.append("text")
# ===========================================================================================================
#-БЛОК ВХОД В 9 КНОПКИ-ДАЛЕЕ=================================================================================
# ===========================================================================================================
            elif menu == '10':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Далее кнопка=====================================================================
                else:
                    if message.text == 'Задание⁉️ (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                        pass # как добавлю базу, будем записывать в таблицу ответы!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                    elif message.text == '↪️Далее':
                        key9, text = choice9(message.text)
                        bot.send_message(message.from_user.id, text, reply_markup=key9)
                        menu = '11'
                        way_list.append(message.text)
# ===========================================================================================================
#-БЛОК ВХОД В 10 КНОПКИ-ВИДЕО================================================================================
# ===========================================================================================================
            elif menu == '11':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                else:
                    key10, text = choice10(message.text)
                    video = open("videos/viyavlenie_potrebnostei.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text,
                                     reply_markup=key10)
                    menu = '12'
                    way_list.append(message.text)
                    study_list.append("Выявление потребности")
                    study_list.append("text")
# ========================================================================================================
# -БЛОК ВХОД В 11 КНОПКИ-ДАЛЕЕ=============================================================================
# ===========================================================================================================
            elif menu == '12':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Далее кнопка===========================================================================
                else:
                    if message.text == 'Задание⁉️ (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                        pass # как добавлю базу, будем записывать в таблицу ответы!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                    elif message.text == '↪️Далее':
                        key12, text = choice11(message.text)
                        bot.send_message(message.from_user.id, text, reply_markup=key12)
                        menu = '13'
                        way_list.append(message.text)
# ===========================================================================================================
#-БЛОК ВХОД В 12 КНОПКИ-ВИДЕО================================================================================
# ===========================================================================================================
            elif menu == '13':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                else:
                    key13, text = choice12(message.text)
                    video = open("videos/prezentacia.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text,
                                     reply_markup=key13)
                    menu = '15'
                    way_list.append(message.text)
                    study_list.append("Презентация")
                    study_list.append("text")
# ===========================================================================================================
# -БЛОК ВХОД В 13 КНОПКИ-ДАЛЕЕ===========================================================================
# ===========================================================================================================
            elif menu == '15':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Далее кнопка===========================================================================
                else:
                    if message.text == 'Задание⁉️ (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                        pass # как добавлю базу, будем записывать в таблицу ответы!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                    elif message.text == '↪️Далее':
                        key15, text = choice13(message.text)
                        bot.send_message(message.from_user.id, text, reply_markup=key15)
                        menu = '17'
                        way_list.append(message.text)
# ===========================================================================================================
# -БЛОК ВХОД В 14 КНОПКИ-ВИДЕО===========================================================================
# ===========================================================================================================
            elif menu == '17':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                else:
                    key16, text = choice14(message.text)
                    video = open("videos/otrabotka_vozrajenii.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text,
                                     reply_markup=key16)
                    menu = '18'
                    way_list.append(message.text)
                    study_list.append("Отработка возражений")
                    study_list.append("text")
# ===========================================================================================================
# -БЛОК ВХОД В 15 КНОПКИ-ДАЛЕЕ===========================================================================
# ===========================================================================================================
            elif menu == '18':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Далее кнопка===========================================================================
                else:
                    if message.text == 'Задание⁉️ (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                        pass # как добавлю базу, будем записывать в таблицу ответы!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                    elif message.text == '↪️Далее':
                        key18, text = choice15(message.text)
                        bot.send_message(message.from_user.id, text, reply_markup=key18)
                        menu = '20'
                        way_list.append(message.text)
# ===========================================================================================================
# -БЛОК ВХОД В 16 КНОПКИ-ВИДЕО===========================================================================
# ===========================================================================================================
            elif menu == '20':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Видео===========================================================================
                else:
                    key19, text = choice16(message.text)
                    video = open("videos/zaverschenie_sdelki.mp4", "rb")
                    bot.send_chat_action(message.from_user.id, 'upload_video')
                    bot.send_video(message.from_user.id, video, supports_streaming=False)
                    video.close()
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню " + text,
                                     reply_markup=key19)
                    menu = '21'
                    way_list.append(message.text)
                    study_list.append("Завершение сделки")
                    study_list.append("text")
# ===========================================================================================================
# -БЛОК ВХОД В 17 КНОПКИ-ДАЛЕЕ===========================================================================
# ===========================================================================================================
            elif menu == '21':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===Далее кнопка===========================================================================
                else:
                    if message.text == 'Задание⁉️ (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                        pass # как добавлю базу, будем записывать в таблицу ответы!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
                    elif message.text == '↪️Далее':
                        key21, text = choice17(message.text)
                        bot.send_message(message.from_user.id, text, reply_markup=key21)
                        menu = '22'
                        way_list.append(message.text)
# ===========================================================================================================
# -БЛОК ВХОД В 18 КНОПКИ-PDF-TEST===========================================================================
# ===========================================================================================================
            elif menu == '22':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)
    # ===PDF-TEST===========================================================================
                else:
                    key22 = choice18(message.text)
                    name = message.from_user.first_name
                    bot.send_message(message.from_user.id, "Дорогой(ая), " + name + "!\nВы в меню Анализа",
                                        reply_markup=key22)
                    menu = '23'
                    way_list.append(message.text)
            elif menu == '23':
    # ===Главная===========================================================================
                if message.text == '🔁Главное меню':
                    menu, way_list, keyboard = mainMenuButton(way_list, menu)
                    bot.send_message(message.from_user.id,
                                     "▪Вы освоите навыки, с которыми будет легко в развитии Себя 🚀 в компании 'Ломбард Белый'\n▪️Мы потратили многие годы 👴🏼👵🏼 и средства💸, что-бы вместить всю нужную информацию в один бот📝\n▪️Вы получите именно ту  информацию 🎯 что Вам необходимо!\n▪️После прохождения курса Вам будет проще принять взвешенное решение в той или иной ситуации.😎🤓\n👇🏼 Развивайся! И расти вместе с Нами!\n🔀 Выберите какой из курсов Вам необходим:",
                                     reply_markup=keyboard)
                    menu = '2'
    # ===Назад===========================================================================
                elif message.text == '↩️Назад':
                    way_list, menu, button = backButton(way_list, menu)
                    message.text = button
                    start_message(message)

                elif message.text == 'Скачать PDF (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                    pass
                    # key23 = choice18(message.text)
                    # document = open("file/FAQ.pdf", 'rb')
                    # bot.send_chat_action(message.from_user.id, 'upload_document')
                    # bot.send_document(message.from_user.id, document)
                    # document.close()
                    # bot.send_message(message.from_user.id, "Вы в меню Анализа", reply_markup=key23)



                elif message.text == 'Пройти Тест (КНОПКА ВРЕМЕННО В РАЗРАБОТКЕ)':
                    pass

    else:
        bot.send_message(message.from_user.id, "Запросите доступ у администратора группы 87078606669")

bot.polling(none_stop=True, interval=0)
